{
  "chord_to_int": {
    "A": 0,
    "A11": 1,
    "A13": 2,
    "A7": 3,
    "A7sus4": 4,
    "A9": 5,
    "Aadd9": 6,
    "Aaug": 7,
    "Ab": 8,
    "Ab7": 9,
    "Abaug": 10,
    "Abdim": 11,
    "Abmaj7": 12,
    "Abmin": 13,
    "Abmin7": 14,
    "Absus4": 15,
    "Adim": 16,
    "Adim7": 17,
    "Amaj7": 18,
    "Amaj9": 19,
    "Amin": 20,
    "Amin7": 21,
    "Amin9": 22,
    "As": 23,
    "As7": 24,
    "Asdim": 25,
    "Asmaj7": 26,
    "Asmin": 27,
    "Asmin7": 28,
    "Asus2": 29,
    "Asus4": 30,
    "B": 31,
    "B11": 32,
    "B7": 33,
    "B7sus4": 34,
    "B9": 35,
    "Badd9": 36,
    "Bb": 37,
    "Bb11": 38,
    "Bb7": 39,
    "Bb9": 40,
    "Bbadd9": 41,
    "Bbaug": 42,
    "Bbdim": 43,
    "Bbmaj7": 44,
    "Bbmaj9": 45,
    "Bbmin": 46,
    "Bbmin7": 47,
    "Bbsus2": 48,
    "Bbsus4": 49,
    "Bdim": 50,
    "Bdim7": 51,
    "Bmaj7": 52,
    "Bmin": 53,
    "Bmin7": 54,
    "Bmin9": 55,
    "Bsus2": 56,
    "Bsus4": 57,
    "C": 58,
    "C13": 59,
    "C7": 60,
    "C7sus4": 61,
    "C9": 62,
    "Cadd9": 63,
    "Caug": 64,
    "Cdim": 65,
    "Cdim7": 66,
    "Cmaj7": 67,
    "Cmaj9": 68,
    "Cmin": 69,
    "Cmin7": 70,
    "Cmin9": 71,
    "Cs": 72,
    "Cs7": 73,
    "Cs7sus4": 74,
    "Cs9": 75,
    "Csdim": 76,
    "Csdim7": 77,
    "Csmaj7": 78,
    "Csmaj9": 79,
    "Csmin": 80,
    "Csmin7": 81,
    "Csmin9": 82,
    "Cssus2": 83,
    "Cssus4": 84,
    "Csus2": 85,
    "Csus4": 86,
    "D": 87,
    "D11": 88,
    "D13": 89,
    "D7": 90,
    "D7sus4": 91,
    "D9": 92,
    "Dadd9": 93,
    "Daug": 94,
    "Db": 95,
    "Db7": 96,
    "Db9": 97,
    "Dbadd9": 98,
    "Dbaug": 99,
    "Dbmaj7": 100,
    "Dbmaj9": 101,
    "Dbmin": 102,
    "Dbmin7": 103,
    "Dbsus4": 104,
    "Ddim": 105,
    "Ddim7": 106,
    "Dmaj7": 107,
    "Dmaj9": 108,
    "Dmin": 109,
    "Dmin7": 110,
    "Dmin9": 111,
    "Ds": 112,
    "Ds7": 113,
    "Dsadd9": 114,
    "Dsdim": 115,
    "Dsdim7": 116,
    "Dsmaj7": 117,
    "Dsmin": 118,
    "Dsmin7": 119,
    "Dsmin9": 120,
    "Dssus4": 121,
    "Dsus2": 122,
    "Dsus4": 123,
    "E": 124,
    "E11": 125,
    "E13": 126,
    "E7": 127,
    "E7sus4": 128,
    "E9": 129,
    "Eadd9": 130,
    "Eaug": 131,
    "Eb": 132,
    "Eb7": 133,
    "Eb7sus4": 134,
    "Ebadd9": 135,
    "Ebaug": 136,
    "Ebdim": 137,
    "Ebmaj7": 138,
    "Ebmaj9": 139,
    "Ebmin": 140,
    "Ebmin7": 141,
    "Ebmin9": 142,
    "Ebsus2": 143,
    "Ebsus4": 144,
    "Edim": 145,
    "Edim7": 146,
    "Emaj7": 147,
    "Emin": 148,
    "Emin7": 149,
    "Emin9": 150,
    "Esus2": 151,
    "Esus4": 152,
    "F": 153,
    "F7": 154,
    "F7sus4": 155,
    "F9": 156,
    "Fadd9": 157,
    "Faug": 158,
    "Fdim": 159,
    "Fdim7": 160,
    "Fmaj13": 161,
    "Fmaj7": 162,
    "Fmaj9": 163,
    "Fmin": 164,
    "Fmin7": 165,
    "Fmin9": 166,
    "Fs": 167,
    "Fs11": 168,
    "Fs7": 169,
    "Fs7sus4": 170,
    "Fsadd9": 171,
    "Fsaug": 172,
    "Fsdim": 173,
    "Fsdim7": 174,
    "Fsmaj7": 175,
    "Fsmin": 176,
    "Fsmin7": 177,
    "Fsmin9": 178,
    "Fssus2": 179,
    "Fssus4": 180,
    "Fsus2": 181,
    "Fsus4": 182,
    "G": 183,
    "G13": 184,
    "G7": 185,
    "G7sus4": 186,
    "G9": 187,
    "Gadd9": 188,
    "Gaug": 189,
    "Gb": 190,
    "Gb7": 191,
    "Gbmaj7": 192,
    "Gbmaj9": 193,
    "Gbmin": 194,
    "Gbmin7": 195,
    "Gdim": 196,
    "Gdim7": 197,
    "Gmaj13": 198,
    "Gmaj7": 199,
    "Gmaj9": 200,
    "Gmin": 201,
    "Gmin7": 202,
    "Gmin9": 203,
    "Gs": 204,
    "Gs7": 205,
    "Gs9": 206,
    "Gsadd9": 207,
    "Gsdim": 208,
    "Gsmaj7": 209,
    "Gsmin": 210,
    "Gsmin7": 211,
    "Gssus4": 212,
    "Gsus2": 213,
    "Gsus4": 214
  },
  "int_to_chord": {
    "0": "A",
    "1": "A11",
    "2": "A13",
    "3": "A7",
    "4": "A7sus4",
    "5": "A9",
    "6": "Aadd9",
    "7": "Aaug",
    "8": "Ab",
    "9": "Ab7",
    "10": "Abaug",
    "11": "Abdim",
    "12": "Abmaj7",
    "13": "Abmin",
    "14": "Abmin7",
    "15": "Absus4",
    "16": "Adim",
    "17": "Adim7",
    "18": "Amaj7",
    "19": "Amaj9",
    "20": "Amin",
    "21": "Amin7",
    "22": "Amin9",
    "23": "As",
    "24": "As7",
    "25": "Asdim",
    "26": "Asmaj7",
    "27": "Asmin",
    "28": "Asmin7",
    "29": "Asus2",
    "30": "Asus4",
    "31": "B",
    "32": "B11",
    "33": "B7",
    "34": "B7sus4",
    "35": "B9",
    "36": "Badd9",
    "37": "Bb",
    "38": "Bb11",
    "39": "Bb7",
    "40": "Bb9",
    "41": "Bbadd9",
    "42": "Bbaug",
    "43": "Bbdim",
    "44": "Bbmaj7",
    "45": "Bbmaj9",
    "46": "Bbmin",
    "47": "Bbmin7",
    "48": "Bbsus2",
    "49": "Bbsus4",
    "50": "Bdim",
    "51": "Bdim7",
    "52": "Bmaj7",
    "53": "Bmin",
    "54": "Bmin7",
    "55": "Bmin9",
    "56": "Bsus2",
    "57": "Bsus4",
    "58": "C",
    "59": "C13",
    "60": "C7",
    "61": "C7sus4",
    "62": "C9",
    "63": "Cadd9",
    "64": "Caug",
    "65": "Cdim",
    "66": "Cdim7",
    "67": "Cmaj7",
    "68": "Cmaj9",
    "69": "Cmin",
    "70": "Cmin7",
    "71": "Cmin9",
    "72": "Cs",
    "73": "Cs7",
    "74": "Cs7sus4",
    "75": "Cs9",
    "76": "Csdim",
    "77": "Csdim7",
    "78": "Csmaj7",
    "79": "Csmaj9",
    "80": "Csmin",
    "81": "Csmin7",
    "82": "Csmin9",
    "83": "Cssus2",
    "84": "Cssus4",
    "85": "Csus2",
    "86": "Csus4",
    "87": "D",
    "88": "D11",
    "89": "D13",
    "90": "D7",
    "91": "D7sus4",
    "92": "D9",
    "93": "Dadd9",
    "94": "Daug",
    "95": "Db",
    "96": "Db7",
    "97": "Db9",
    "98": "Dbadd9",
    "99": "Dbaug",
    "100": "Dbmaj7",
    "101": "Dbmaj9",
    "102": "Dbmin",
    "103": "Dbmin7",
    "104": "Dbsus4",
    "105": "Ddim",
    "106": "Ddim7",
    "107": "Dmaj7",
    "108": "Dmaj9",
    "109": "Dmin",
    "110": "Dmin7",
    "111": "Dmin9",
    "112": "Ds",
    "113": "Ds7",
    "114": "Dsadd9",
    "115": "Dsdim",
    "116": "Dsdim7",
    "117": "Dsmaj7",
    "118": "Dsmin",
    "119": "Dsmin7",
    "120": "Dsmin9",
    "121": "Dssus4",
    "122": "Dsus2",
    "123": "Dsus4",
    "124": "E",
    "125": "E11",
    "126": "E13",
    "127": "E7",
    "128": "E7sus4",
    "129": "E9",
    "130": "Eadd9",
    "131": "Eaug",
    "132": "Eb",
    "133": "Eb7",
    "134": "Eb7sus4",
    "135": "Ebadd9",
    "136": "Ebaug",
    "137": "Ebdim",
    "138": "Ebmaj7",
    "139": "Ebmaj9",
    "140": "Ebmin",
    "141": "Ebmin7",
    "142": "Ebmin9",
    "143": "Ebsus2",
    "144": "Ebsus4",
    "145": "Edim",
    "146": "Edim7",
    "147": "Emaj7",
    "148": "Emin",
    "149": "Emin7",
    "150": "Emin9",
    "151": "Esus2",
    "152": "Esus4",
    "153": "F",
    "154": "F7",
    "155": "F7sus4",
    "156": "F9",
    "157": "Fadd9",
    "158": "Faug",
    "159": "Fdim",
    "160": "Fdim7",
    "161": "Fmaj13",
    "162": "Fmaj7",
    "163": "Fmaj9",
    "164": "Fmin",
    "165": "Fmin7",
    "166": "Fmin9",
    "167": "Fs",
    "168": "Fs11",
    "169": "Fs7",
    "170": "Fs7sus4",
    "171": "Fsadd9",
    "172": "Fsaug",
    "173": "Fsdim",
    "174": "Fsdim7",
    "175": "Fsmaj7",
    "176": "Fsmin",
    "177": "Fsmin7",
    "178": "Fsmin9",
    "179": "Fssus2",
    "180": "Fssus4",
    "181": "Fsus2",
    "182": "Fsus4",
    "183": "G",
    "184": "G13",
    "185": "G7",
    "186": "G7sus4",
    "187": "G9",
    "188": "Gadd9",
    "189": "Gaug",
    "190": "Gb",
    "191": "Gb7",
    "192": "Gbmaj7",
    "193": "Gbmaj9",
    "194": "Gbmin",
    "195": "Gbmin7",
    "196": "Gdim",
    "197": "Gdim7",
    "198": "Gmaj13",
    "199": "Gmaj7",
    "200": "Gmaj9",
    "201": "Gmin",
    "202": "Gmin7",
    "203": "Gmin9",
    "204": "Gs",
    "205": "Gs7",
    "206": "Gs9",
    "207": "Gsadd9",
    "208": "Gsdim",
    "209": "Gsmaj7",
    "210": "Gsmin",
    "211": "Gsmin7",
    "212": "Gssus4",
    "213": "Gsus2",
    "214": "Gsus4"
  }
}