{
  "chord_to_idx": {
    "Amaj": 0,
    "Amin": 1,
    "A7": 2,
    "Amaj7": 3,
    "Amin7": 4,
    "Adim": 5,
    "Am7b5": 6,
    "Asus4": 7,
    "A6": 8,
    "A9": 9,
    "Amin9": 10,
    "Amaj9": 11,
    "A13": 12,
    "A#maj": 13,
    "A#min": 14,
    "A#7": 15,
    "A#maj7": 16,
    "A#min7": 17,
    "A#dim": 18,
    "A#m7b5": 19,
    "A#sus4": 20,
    "A#6": 21,
    "A#9": 22,
    "A#min9": 23,
    "A#maj9": 24,
    "A#13": 25,
    "Bmaj": 26,
    "Bmin": 27,
    "B7": 28,
    "Bmaj7": 29,
    "Bmin7": 30,
    "Bdim": 31,
    "Bm7b5": 32,
    "Bsus4": 33,
    "B6": 34,
    "B9": 35,
    "Bmin9": 36,
    "Bmaj9": 37,
    "B13": 38,
    "Cmaj": 39,
    "Cmin": 40,
    "C7": 41,
    "Cmaj7": 42,
    "Cmin7": 43,
    "Cdim": 44,
    "Cm7b5": 45,
    "Csus4": 46,
    "C6": 47,
    "C9": 48,
    "Cmin9": 49,
    "Cmaj9": 50,
    "C13": 51,
    "C#maj": 52,
    "C#min": 53,
    "C#7": 54,
    "C#maj7": 55,
    "C#min7": 56,
    "C#dim": 57,
    "C#m7b5": 58,
    "C#sus4": 59,
    "C#6": 60,
    "C#9": 61,
    "C#min9": 62,
    "C#maj9": 63,
    "C#13": 64,
    "Dmaj": 65,
    "Dmin": 66,
    "D7": 67,
    "Dmaj7": 68,
    "Dmin7": 69,
    "Ddim": 70,
    "Dm7b5": 71,
    "Dsus4": 72,
    "D6": 73,
    "D9": 74,
    "Dmin9": 75,
    "Dmaj9": 76,
    "D13": 77,
    "D#maj": 78,
    "D#min": 79,
    "D#7": 80,
    "D#maj7": 81,
    "D#min7": 82,
    "D#dim": 83,
    "D#m7b5": 84,
    "D#sus4": 85,
    "D#6": 86,
    "D#9": 87,
    "D#min9": 88,
    "D#maj9": 89,
    "D#13": 90,
    "Emaj": 91,
    "Emin": 92,
    "E7": 93,
    "Emaj7": 94,
    "Emin7": 95,
    "Edim": 96,
    "Em7b5": 97,
    "Esus4": 98,
    "E6": 99,
    "E9": 100,
    "Emin9": 101,
    "Emaj9": 102,
    "E13": 103,
    "Fmaj": 104,
    "Fmin": 105,
    "F7": 106,
    "Fmaj7": 107,
    "Fmin7": 108,
    "Fdim": 109,
    "Fm7b5": 110,
    "Fsus4": 111,
    "F6": 112,
    "F9": 113,
    "Fmin9": 114,
    "Fmaj9": 115,
    "F13": 116,
    "F#maj": 117,
    "F#min": 118,
    "F#7": 119,
    "F#maj7": 120,
    "F#min7": 121,
    "F#dim": 122,
    "F#m7b5": 123,
    "F#sus4": 124,
    "F#6": 125,
    "F#9": 126,
    "F#min9": 127,
    "F#maj9": 128,
    "F#13": 129,
    "Gmaj": 130,
    "Gmin": 131,
    "G7": 132,
    "Gmaj7": 133,
    "Gmin7": 134,
    "Gdim": 135,
    "Gm7b5": 136,
    "Gsus4": 137,
    "G6": 138,
    "G9": 139,
    "Gmin9": 140,
    "Gmaj9": 141,
    "G13": 142,
    "G#maj": 143,
    "G#min": 144,
    "G#7": 145,
    "G#maj7": 146,
    "G#min7": 147,
    "G#dim": 148,
    "G#m7b5": 149,
    "G#sus4": 150,
    "G#6": 151,
    "G#9": 152,
    "G#min9": 153,
    "G#maj9": 154,
    "G#13": 155,
    "<start>": 156,
    "<end>": 157,
    "<unk>": 158
  },
  "idx_to_chord": {
    "0": "A",
    "1": "Amin",
    "2": "A7",
    "3": "Amaj7",
    "4": "Amin7",
    "5": "Adim",
    "6": "Am7b5",
    "7": "Asus4",
    "8": "A6",
    "9": "A9",
    "10": "Amin9",
    "11": "Amaj9",
    "12": "A13",
    "13": "A#",
    "14": "A#min",
    "15": "A#7",
    "16": "A#maj7",
    "17": "A#min7",
    "18": "A#dim",
    "19": "A#m7b5",
    "20": "A#sus4",
    "21": "A#6",
    "22": "A#9",
    "23": "A#min9",
    "24": "A#maj9",
    "25": "A#13",
    "26": "B",
    "27": "Bmin",
    "28": "B7",
    "29": "Bmaj7",
    "30": "Bmin7",
    "31": "Bdim",
    "32": "Bm7b5",
    "33": "Bsus4",
    "34": "B6",
    "35": "B9",
    "36": "Bmin9",
    "37": "Bmaj9",
    "38": "B13",
    "39": "C",
    "40": "Cmin",
    "41": "C7",
    "42": "Cmaj7",
    "43": "Cmin7",
    "44": "Cdim",
    "45": "Cm7b5",
    "46": "Csus4",
    "47": "C6",
    "48": "C9",
    "49": "Cmin9",
    "50": "Cmaj9",
    "51": "C13",
    "52": "C#",
    "53": "C#min",
    "54": "C#7",
    "55": "C#maj7",
    "56": "C#min7",
    "57": "C#dim",
    "58": "C#m7b5",
    "59": "C#sus4",
    "60": "C#6",
    "61": "C#9",
    "62": "C#min9",
    "63": "C#maj9",
    "64": "C#13",
    "65": "D",
    "66": "Dmin",
    "67": "D7",
    "68": "Dmaj7",
    "69": "Dmin7",
    "70": "Ddim",
    "71": "Dm7b5",
    "72": "Dsus4",
    "73": "D6",
    "74": "D9",
    "75": "Dmin9",
    "76": "Dmaj9",
    "77": "D13",
    "78": "D#",
    "79": "D#min",
    "80": "D#7",
    "81": "D#maj7",
    "82": "D#min7",
    "83": "D#dim",
    "84": "D#m7b5",
    "85": "D#sus4",
    "86": "D#6",
    "87": "D#9",
    "88": "D#min9",
    "89": "D#maj9",
    "90": "D#13",
    "91": "E",
    "92": "Emin",
    "93": "E7",
    "94": "Emaj7",
    "95": "Emin7",
    "96": "Edim",
    "97": "Em7b5",
    "98": "Esus4",
    "99": "E6",
    "100": "E9",
    "101": "Emin9",
    "102": "Emaj9",
    "103": "E13",
    "104": "F",
    "105": "Fmin",
    "106": "F7",
    "107": "Fmaj7",
    "108": "Fmin7",
    "109": "Fdim",
    "110": "Fm7b5",
    "111": "Fsus4",
    "112": "F6",
    "113": "F9",
    "114": "Fmin9",
    "115": "Fmaj9",
    "116": "F13",
    "117": "F#",
    "118": "F#min",
    "119": "F#7",
    "120": "F#maj7",
    "121": "F#min7",
    "122": "F#dim",
    "123": "F#m7b5",
    "124": "F#sus4",
    "125": "F#6",
    "126": "F#9",
    "127": "F#min9",
    "128": "F#maj9",
    "129": "F#13",
    "130": "G",
    "131": "Gmin",
    "132": "G7",
    "133": "Gmaj7",
    "134": "Gmin7",
    "135": "Gdim",
    "136": "Gm7b5",
    "137": "Gsus4",
    "138": "G6",
    "139": "G9",
    "140": "Gmin9",
    "141": "Gmaj9",
    "142": "G13",
    "143": "G#",
    "144": "G#min",
    "145": "G#7",
    "146": "G#maj7",
    "147": "G#min7",
    "148": "G#dim",
    "149": "G#m7b5",
    "150": "G#sus4",
    "151": "G#6",
    "152": "G#9",
    "153": "G#min9",
    "154": "G#maj9",
    "155": "G#13",
    "156": "<start>",
    "157": "<end>",
    "158": "<unk>"
  },
  "notes": [
    "A",
    "A#",
    "B",
    "C",
    "C#",
    "D",
    "D#",
    "E",
    "F",
    "F#",
    "G",
    "G#"
  ],
  "modifiers": [
    "",
    "min",
    "7",
    "maj7",
    "min7",
    "dim",
    "m7b5",
    "sus4",
    "6",
    "9",
    "min9",
    "maj9",
    "13"
  ]
}